mvno-normalizer-fe/public/assets/mocks/soap-missing-phone.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sms="http://example.com/sms">
  <soapenv:Body>
    <sms:ChargeSMS>
      <UserID>USER123</UserID>
      <MessageID>MSG-003</MessageID>
      <ChargeAmount>0.15</ChargeAmount>
      <Currency>EUR</Currency>
      <Timestamp>2025-11-06T15:30:45Z</Timestamp>
    </sms:ChargeSMS>
  </soapenv:Body>
</soapenv:Envelope>
